In [97]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score

In [98]:
data = pd.read_csv(r'Salary_Data.csv')
data

   Location       Job Role  Experience (Years)      Degree   Salary
0   Kolkata   Data Analyst                   0  Bachelor's        0
1   Kolkata   Data Analyst                   1    Master's   200000
2   Kolkata   Data Analyst                   2         PhD   350000
3   Kolkata   Data Analyst                   3  Bachelor's   400000
4   Kolkata   Data Analyst                   4    Master's   600000
..      ...            ...                 ...         ...      ...
85     Pune  Java Engineer                   5         PhD   900000
86     Pune  Java Engineer                   6  Bachelor's  1000000
87     Pune  Java Engineer                   7    Master's  1200000
88     Pune  Java Engineer                   2  Bachelor's   300000
89     Pune  Java Engineer                   3    Master's   400000

[90 rows x 5 columns]

In [99]:
sample_data = pd.read_csv(r'sample_test_data.csv')
sample_data

  Location        Job Role  Experience (Years) Degree
0  Kolkata  Data Scientist                   5   PhD

In [100]:
dataMapping_location = {
    'Kolkata': 1,
    'Bangalore':2,
    'Pune':3
}

dataMapping_job_role = {
    'Data Analyst': 1,
    'Data Scientist': 2,
    'Java Engineer': 3,
}

dataMapping_degree = {
    "Bachelor's": 1,
    "Master's": 2,
    "PhD":3
}

In [101]:
sample_data['Location'] = sample_data['Location'].map(dataMapping_location)
sample_data['Job Role'] = sample_data['Job Role'].map(dataMapping_job_role)
sample_data['Degree'] = sample_data['Degree'].map(dataMapping_degree)
sample_data

   Location  Job Role  Experience (Years)  Degree
0         1         2                   5     NaN

In [102]:
data['Location'] = data['Location'].map(dataMapping_location)
data['Job Role'] = data['Job Role'].map(dataMapping_job_role)
data['Degree'] = data['Degree'].map(dataMapping_degree)
data

    Location  Job Role  Experience (Years)  Degree   Salary
0          1         1                   0       1        0
1          1         1                   1       2   200000
2          1         1                   2       3   350000
3          1         1                   3       1   400000
4          1         1                   4       2   600000
..       ...       ...                 ...     ...      ...
85         3         3                   5       3   900000
86         3         3                   6       1  1000000
87         3         3                   7       2  1200000
88         3         3                   2       1   300000
89         3         3                   3       2   400000

[90 rows x 5 columns]

In [103]:
X = data[['Location', 'Job Role', 'Experience (Years)', 'Degree']]
y = data['Salary']

In [104]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)
rfrg = RandomForestRegressor(n_estimators=100,random_state=1)
X_test

    Location  Job Role  Experience (Years)  Degree
2          1         1                   2       3
13         1         2                   3       3
53         2         3                   3       1
41         2         2                   1       1
66         3         1                   6       1
30         2         1                   0       1
45         2         2                   5       2
43         2         2                   3       3
78         3         2                   2       3
89         3         3                   3       2
7          1         1                   7       2
26         1         3                   6       1
33         2         1                   3       1
63         3         1                   3       1
8          1         1                   2       1
16         1         2                   6       3
24         1         3                   4       2
56         2         3                   6       1

In [105]:
rfrg.fit(X_train,y_train)
y_pred = rfrg.predict(X_test)
mean_squared_error(y_test,y_pred)
score = r2_score(y_test, y_pred)
score

0.8895118535333597

In [106]:
prediction_with_sample_data = rfrg.predict(sample_data)
prediction_with_sample_data

ValueError: Input contains NaN, infinity or a value too large for dtype('float32').